import React from "react";
import "./news.scss";

const messages = [
  {
    id: 1,
    name: "admin",
    date: "10.01.2025",
    message:
      "Відкрито новий проєкт! Ми раді повідомити, що наш відділ отримав нове замовлення на дизайн . Проєкт включає розробку сучасного дизайну для  сайту офісу з акцентом на  ключові деталі, екологічність, мінімалізм. Більш детальну інформацію буде надано на командній зустрічі о 10:00 в середу 12.01.2025.",
  },
  {
    id: 2,
    name: "admin",
    date: "20.12.2024",
    message:
      "Завершення поточного проєкту! Нагадуємо, що нам потрібно завершити роботу над проєктом [назва проєкту] до [дата]. Просимо всіх залучених співробітників активізувати зусилля для своєчасного виконання завдань. Якщо виникають питання або потрібна допомога, звертайтеся до керівника проєкту. Дякуємо за вашу плідну роботу та відданість! Разом досягнемо нових вершин у розробці завдань. ",
  },
  {
    id: 3,
    name: "admin",
    date: "15.11.2024",
    message:
      "Шановні колеги! Нагадуємо про важливість підтримки високого рівня обслуговування клієнтів. Просимо вас уважно стежити за дотриманням дедлайнів, вчасно відповідати на запити та підтримувати ефективну комунікацію з нашими клієнтами. Якщо у вас виникають складнощі або запитання, будь ласка, звертайтеся до керівника відділу для швидкого вирішення ситуацій. Якість нашого обслуговування – запорука успіху! ",
  },
  {
    id: 4,
    name: "admin",
    date: "22.10.2024",
    message:
      "Шановні колеги! Нагадуємо, що завтра, [дата], ми святкуємо день народження нашого колеги, [ім'я]. Запрошуємо всіх приєднатися до привітань та святкового чаювання, яке відбудеться о [час] в зоні відпочинку. Не забудьте привітати [ім'я] з цим чудовим днем! З повагою, [ ім'я]Керівник відділу дизайну",
  },
  {
    id: 5,
    name: "admin",
    date: "11.09.2024",
    message:
      "Шановні колеги! Нагадуємо про важливість підтримки високої продуктивності в нашій команді. Зараз у нас на руках кілька важливих проєктів, і їх своєчасне виконання залежить від кожного з нас. Просимо вас максимально ефективно використовувати робочий час, планувати завдання і стежити за дедлайнами. Якщо виникають труднощі або є пропозиції щодо покращення процесів, не соромтеся звертатися до керівництва. Ваша продуктивність – це наш спільний успіх!",
  },
  {
    id: 6,
    name: "admin",
    date: "1.09.2024",
    message:
      "Шановні колеги! З нагоди Дня знань вітаємо всіх, хто має дітей або сам навчається! 1 вересня – це символ нових починань і можливостей, тому бажаємо вам успіхів у всіх справах, як особистих, так і професійних. Підтримуйте баланс між роботою і навчанням ваших дітей. Нехай новий навчальний рік буде легким і продуктивним для всіх! З повагою,[ім'я] Керівник відділу дизайну",
  },
];

function News() {
  return (
    <div className="news">
      <div className="container">
        <div className="chatName">Our News</div>
        {messages.map((message) => (
          <div className="blockMessage" key={message.id}>
            <span className="userName">{message.name}</span>
            <div className="message">{message.message}</div>
            <span className="data">date {message.date}</span>
          </div>
        ))}
        <div className="blockMessage"></div>
      </div>
    </div>
  );
}

export default News;
